{
  "title": "Step 4: Adding more objects to scene and removing fireflies",
  "cells": [
    {
      "type": "text",
      "data": "Here I have added a side table, a lamp and a pillow (these were not modeled by me).<div><img src=\"quiver-image-url/45D4D41B7750C14D69CCE8B8F365D350.jpg\" alt=\"render011.jpg\" width=\"960\" height=\"540\"><br></div><div><br></div><div>Fireflies are the white spots all over the scene. This is caused when you have a lot of indirect lighting in the scene. Correcting this is done in a few different ways. First is to remove caustics in the scene. The settings for this are shown below:</div><div><img src=\"quiver-image-url/063A31A51E27CD0C90EA516F2A33FC8B.jpg\" width=\"396\" height=\"430\"><br></div><div><br></div><div>Rendered below a small section of the scene with both Reflective Caustics and Refractive Caustics turned on:</div><div><img src=\"quiver-image-url/BBC70CDE4E9A75F365AA07DA0B61A01A.jpg\" width=\"182\" height=\"312\"><br></div><div><br></div><div>Next, same section with Caustics turned off:</div><div><img src=\"quiver-image-url/40CAC622667C8F1C9887CDAD0C9DE811.jpg\" width=\"182\" height=\"312\"><br></div><div><br></div><div>Quite a bit of improvement, but not entirely gone. 2nd, apparently the light bulb in the lamp has an emission shader, which means it is transmitting light into the scene. According to my tutorials, you should never have artificial light in a scene in daylight. Removed the emission shader and made the bulb transparent. I am also rendering at 20 samples, which is kinda low, but higher samples cause very, very long render times. So that will have to wait until I have a lot more time to wait for renders.</div><div><br></div><div>Here is a render with more added objects and caustics turned off:</div><div><img src=\"quiver-image-url/1B47584A052DFE4BDD532B344DF621D3.png\" alt=\"render012.png\" width=\"960\" height=\"540\"><br></div><div><br></div><div>Yet another means to get rid of fireflies is the set the Indirect Clamping value. Here is is set to 5.0:</div><div><img src=\"quiver-image-url/A97B748CA3842B2DC3B49708F01EB7C2.jpg\" width=\"396\" height=\"450\"><br></div><div><br></div><div>Another full render which pretty much kills the rest of the fireflies:</div><div><img src=\"quiver-image-url/D887E86579AF7B168E55E9995DEEC4B8.png\" alt=\"render013.png\" width=\"960\" height=\"540\"><br></div>"
    }
  ]
}