{
  "title": "Step 1: The Face",
  "cells": [
    {
      "type": "text",
      "data": "Am taking a tutorial on building a game character in Blender from scratch. This is a very complex project that I think will take a very long time. I have tried this kind of thing before with little success. Thought I would try it again and document the process and in particular track the time it took to do it.<div><br></div><div>Started with a circle and built out from the eye. Here is where I am at the moment.</div><div><br></div><div><img src=\"quiver-image-url/8E9C84DFB636C1D9F584C5CD7366CA5C.jpg\" width=\"557\" height=\"328\"><br></div><div>Am tracking each section separately. This is the face section. I am 2 hours and 4 minutes into this section,</div><div>and 2 hours and 4 minutes total.</div><div><br></div><div>Extending the face downward by extruding the selected vertices:</div><div><br></div><div><img src=\"quiver-image-url/A8476C162305A7819113660621492530.jpg\" width=\"527\" height=\"331\"><br></div><div><br></div><div>Expanding the face upward for the forehead and backwards towards the ears.</div><div>1 hour 10 minutes today with 3 hours 16 minutes total.</div><div><br></div><div><img src=\"quiver-image-url/8D0DB430F3F424509FB60DED8E99B69A.jpg\" width=\"516\" height=\"351\"><br></div><div><br></div><div>Only modeling what is visible in the character as the rest of the face is hidden. Not doing the eyeball, which is a bit difficult. Here it is as the moment.</div><div>Have used 45 minutes for this with a total time of 3 hours and 55 minutes.</div><div><br></div><div><img src=\"quiver-image-url/5B96550A64FAF343047B0AB88F71E32E.png\" alt=\"face03.png\" width=\"567\" height=\"381\"><br></div><div><br></div><div>Have completed the eyes by applying rotation and scale, setting the center point of the eye to 0,0,0 and</div><div>adding a mirror modifier. This completes the face as we are only modeling what shows outside the mask and hood.</div><div><br></div><div><img src=\"quiver-image-url/34B2F8128D57CB64B923A257E0E9F4AC.jpg\" width=\"833\" height=\"512\"><br></div><div><br></div><div>This took 34 minutes with a total of &nbsp;4 hours 30 minutes for the project.</div>"
    }
  ]
}