{
  "title": "4/21/17",
  "cells": [
    {
      "type": "text",
      "data": "Was coming home from work on my motorcycle at roughly 3:30 - 4pm. Traffic was horrendous on the 118 freeway, so I decided to get off at the next exit which happened to be Tampa Blvd. I went south on Tampa and got in the left turn lane to turn left on Chatsworth.<div><br></div><div>The light was red when I got there (I was first in line), so I waited for the light to change. When it changed to green, I pulled out into the intersection and waited for traffic going north bound on Tampa to clear or the light to change. The light changed and I waited for traffic to stop which it did. I proceeded to make the turn when I saw a red car go around traffic and attempt to make the light, even though the light was already red. I headed directly for me as I heard them slam on their brakes.&nbsp;</div><div><br></div><div>I knew I was going to be hit, and I knew there was nothing I could do about it. It hit me directly on my right side and the next thing I new I was laying on my side in the street. I never lost consciousness and I remember everything that happened in detail. I wish I had been unconscious.</div><div><br></div><div>I heard a lot of voices as people crowded around me. I made no effort to move. I was afraid that someone would take my stuff. I was carrying three computers (One brand new that I had just bought) in two backpacks. One on my back and the other strapped to the back of my bike.&nbsp;</div><div><br></div><div>People were asking me lots of questions. Where was I hurt, could I move, etc. Someone asked if there was someone they could call. I gave them my wife’s number. I found out later that she did not answer when she didn’t recognize the number. She must have listened to voice mail, as I heard my phone ringing and I could see here number on my Apple watch.&nbsp;</div><div><br></div><div>I asked someone to answer the phone even though no one knew where my phone was. I heard sirens and then heard paramedics asking me questions. They were cutting off my pants, my motorcycle jacket and vest. They said I was lucky to be wearing all the protective gear I was wearing. I asked about my backpacks and they said they had them.</div><div><br></div><div>I was rushed to the hospital that was only a couple of miles away.</div>"
    }
  ]
}