{
  "title": "Setup for next months project tracking",
  "cells": [
    {
      "type": "text",
      "data": "Have been looking at web sites that claim to have the inside track on how to get things done, especially on complex subject matter. I have been working on this for some time, but have realized that I have forgotten a important step. Analyzing how things are going and seeing what works and what doesn’t.&nbsp;<div><br></div><div>So, starting with May, I am going to track my progress across all my projects every month and changing my process accordingly.</div><div><br></div><div>First, here I will list all of my projects or plans and show where they are right now, so I have a baseline as to where to start measuring:</div><div><br></div><div><ol><li>SteamBot - Android</li><ol><li>At this point I am struggling to code the Bot to collide with the water bubbles and then gain water for the vials, and delete the waterbubble from the game</li></ol><li>SteamBot - SpriteKit</li><ol><li>This has been on hold for a while. &nbsp;Looking at it now, the entire in-game interface is in place, but scoring is not yet working. Does not seem to be any levels as well although the level indicator is in place. Landing on the burners needs to be improved. Saving current state of game seems to work.</li></ol><li>SteamBot - Apple TV</li><ol><li>No progress made on this, have simply created a base project to begin development</li></ol><li>Agents Office exterior (Farmers)</li><ol><li>Have imported buildings (just basic shapes) and have a beginning of the sidewalk</li></ol><li>Style Frames (The Futur)</li><ol><li>About half way through this, but I think they have added additional content</li></ol><li>Blender/Substance Painter class</li><ol><li>Really was hoping to be a lot further along than this. Need to complete the model in Blender before going into Substance Painter. Currently at 53% in class.</li></ol><li>3d Game Assets (Devslopes)</li><li>Jeep Model (Udemy)</li><ol><li>Have the first part of the hood completed</li></ol><li>Character Model (Udemy)</li><ol><li>This one has been on hold for a while. Very complex class. Currently at 11%.&nbsp;</li></ol><li>30 second ballet animation</li><ol><li>Just a rough idea with no animation completed</li></ol><li>Be The Dragon game (Unity and/or Godot)</li><ol><li>No progress on this lately, have just a bare idea of the dragon model</li></ol><li>RPG Design class (Unity - Awesome Tuts)</li><ol><li>Not making much progress on this, though currently at 35%</li></ol><li>CSS Animation (Lynda.com)</li><ol><li>Have taken several classes on this, but cannot independently create any sites. Plan to go back to using SASS and GULP, so need to retake that class and get the setup correct.</li></ol><li>Stephanie’s Web Site</li><ol><li>This goes back to 13, as I have made little progress</li></ol><li>Flutter class (Unity)</li><ol><li>Have made a fair amount of progress, as I am at lesson 96 of 170 (20% complete)</li></ol></ol></div>"
    },
    {
      "type": "text",
      "data": ""
    }
  ]
}